using IFCore;
using System;
using System.Collections.Generic;
using Telegram.Bot;
using Telegram_Bot.View.Interface;
using Telegram.Bot.Args;
using Telegram.Bot.Types.Enums;

namespace Telegram_Bot.View.Classes.Menu
{
    public class ListCallsLessons: MainMenu, IMenu
    {
        private TelegramBotClient BotRoma;
        private string ApiKeyBot;
        public ListCallsLessons(TelegramBotClient Bot, string api, Dictionary<string, List<SheldueAllDaysTelegram>> sheldue) : base(Bot, api, ref sheldue)
        {
            BotRoma = Bot;
            ApiKeyBot = api;
        }

        public async void SendMessageCallLesson(object sender, MessageEventArgs e)
        {
            var message = e.Message;
            string callsLessonTextChetDay = $@"Расписание звонков *2019\/2020*, 2 полугодие

*Понеделник, Среда, Пятница*
1,3 курс *ПТО*, 2 курс *ПТО, ССО*
                 *По 45 минуту*
*1\.*               8\.30 \-  9\.15
                  9\.25 \- 10\.10
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*2\.*              10\.20 \- 11\.05
                 11\.15 \- 12\.00
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*3\.**3\.1*      12\.10 \| *Обед*   12\.30
               12\.55 \|                13\.00
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
 *Обед*   12\.10 \| *3\.1*   12\.30
               12\.55 \|          13\.15
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
   *3\.2*       13\.25 \| *3\.2*   13\.25
                14\.10 \|          14\.10
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*4\.*            14\.20 \- 15\.05
               15\.15 \- 16\.00
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*5\.*            16\.10 \- 16\.55
               17\.05 \- 17\.50
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*6\.*            18\.00 \- 18\.45
               18\.55 \-19\.40";
            string callsLessonTextNoChetDay = $@"Расписание звонков 2019\/2020, 2 полугодие

*Вторник, Четверг*
1,3 курс *ПТО*, 2 курс *ПТО, ССО*
                 *По 45 минуту*

*1\.*               8\.30 \-  9\.15
                  9\.25 \- 10\.10
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*2\.*              10\.20 \- 11\.05
                 11\.15 \- 12\.00
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*3\.**3\.1*      12\.10 \| *Обед*   12\.30
               12\.55 \|                13\.15
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
 *Обед*   13\.25 \| *3\.1*   12\.30
               13\.55 \|          13\.15
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
   *3\.2*       13\.25 \| *3\.2*   13\.25
                14\.10 \|          14\.10
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
Кур\.\/         14\.20 \- 15\.05
Инф\.Час
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*4\.*            15\.15 \- 16\.00
               16\.10 \- 16\.55
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*5\.*            17\.05 \- 17\.50
               18\.00 \- 18\.45
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*6\.*            18\.55 \- 19\.40
               19\.50 \- 20\.35";
            string callsLessonTextSurthday = $@"Расписание звонков 2019\/2020, 2 полугодие

*Суббота*
        *По 45 минуту*
*1\.*              8\.30 \-  9\.15
                  9\.25 \- 10\.10
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*2\.*              10\.20 \- 11\.05
                 11\.15 \- 12\.00
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*3\.*              12\.15 \| 13\.00
                 13\.10 \| 13\.55
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*4\.*              14\.05 \- 14\.50
                 15\.00 \- 15\.45
\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_
*5\.*              15\.55 \- 16\.40
                 16\.50 \- 17\.35";
            try { await BotRoma.SendTextMessageAsync(message.Chat.Id, callsLessonTextChetDay, ParseMode.MarkdownV2, replyMarkup: new Keyboards().Personality()); } catch { }
            try { await BotRoma.SendTextMessageAsync(message.Chat.Id, callsLessonTextNoChetDay, ParseMode.MarkdownV2, replyMarkup: new Keyboards().Personality()); } catch { }
            try { await BotRoma.SendTextMessageAsync(message.Chat.Id, callsLessonTextSurthday, ParseMode.MarkdownV2, replyMarkup: new Keyboards().Personality()); } catch { }
        }
    }
}
